*** Cleaning
#+BEGIN_SRC R :session
  # this file aims to replicate all of Cody Ross's analysis
  # but using the more comprehensive Washington Post data

  library(plyr)
  library(reshape2)
  library(acs)
  library(rstan)
  rstan_options(auto_write = TRUE)
  options(mc.cores = parallel::detectCores())
  options(stringsAsFactors=FALSE)

  ## Load and rearrange the WaPo Data
  wapo <- read.csv('/home/kesslerd/repos/Analysis/PoliceShootings/data-police-shootings/fatal-police-shootings-data.csv')

  wapo <- addCounties(wapo)
  wapo <- binarizeArmed(wapo)
  wapo.summary <- summarizeShooting(wapo)

  wapo.fortify <- fortifyCody(wapo.summary)
  names(wapo.fortify)
  #str(wapo.fortify)
  #wapo.fortify [ is.na(wapo.fortify$src.cody),1:10][3,2]
#+END_SRC

#+RESULTS:
| State                         |
| County.Name                   |
| B_armed                       |
| B_unarmed                     |
| H_armed                       |
| H_unarmed                     |
| W_armed                       |
| W_unarmed                     |
| src.wapo                      |
| SortGADMintoPrevOrder         |
| SortGADMintoGADMintoGADMorder |
| County.FIPS.Code              |
| FIPS                          |
| DMA                           |
| WeaponsBlack.sum              |
| WeaponsWhite.sum              |
| AssaultsBlack.sum             |
| AssaultsWhite.sum             |
| county                        |
| CountyName                    |
| ID                            |
| TOT_POP                       |
| TOT_MALE                      |
| TOT_FEMALE                    |
| WA_TOT                        |
| BAC_TOT                       |
| H_TOT                         |
| Pct.Uninsured                 |
| Median.Income                 |
| Gini                          |
| Pct.Living.in.Poverty         |
| Pct.HS.Education              |
| PercentSlaveOwningFarms       |
| NSlavesPerCounty              |
| ID.1                          |
| FBIDataToRight                |
| VictimsOfHateCrimes           |
| MURDER                        |
| AGASSLT                       |
| USPSDToRight                  |
| BlackArmed                    |
| BlackUnarmed                  |
| HispanicArmed                 |
| HispanicUnarmed               |
| WhiteArmed                    |
| WhiteUnarmed                  |
| State.1                       |
| RandID                        |
| SouthernLawCenterDataToRight  |
| Arson                         |
| Assault                       |
| Bombing                       |
| Cross.Burnings                |
| Harassment                    |
| Intelligence                  |
| Intimidation                  |
| Leafletting                   |
| Legal.Developments            |
| Murder                        |
| Rally                         |
| Threat                        |
| Vandalism                     |
| BayesianPosterior             |
| ModelID                       |




**** R Code
#+BEGIN_SRC R :noweb yes
  mycode <- " 
  <<somestancode>> 
  "
#+END_SRC

#+RESULTS:
|                                                                      |
| data {                                                               |
| int<lower=0> nc ; // number of counties                              |
| int<lower=0> X[nc][2]; // number of shootings for county i at time j |
| }                                                                    |
|                                                                      |
| parameters {                                                         |
| real<lower=0> lambda; // the shooting rate?                          |
| }                                                                    |
|                                                                      |
| model {                                                              |
| for (i in 1:nc)                                                      |
| X[i] ~ normal(mu,sigma);                                             |
| }                                                                    |
|                                                                      |

